SQL lite is self -contained , serverless and zero configuration database engine that is widely used in embedded databse systems.

In [1]:
# With pythono 3 sql lite is installed on its own , we donot need to pip
import sqlite3 as sql

In [2]:
# made a db
connection = sql.connect('example.db')

In [3]:
cursor = connection.cursor()

In [4]:

# Creating a table using cursor object
cursor.execute('''
Create Table If Not Exists employees(
  id Integer Primary Key,
  name Text Not Null,
  age Integer,
  department text
  )
''')

#Comminting the cahnges
connection.commit()

In [5]:
cursor.execute('''
Select * from employees
''')

In [6]:
# Inserting the data
cursor.execute('''
INSERT INTO employees (id,name,age,department) values (101,'ANAND RAJ',24,'DATA SCIENCE')
''')

In [7]:
# cursor.execute('''
# INSERT INTO employees (id,name,age,department) values (101,'ANAND RAJ',24,'DATA SCIENCE')
# ''')
# cursor.execute('''
# INSERT INTO employees (id,name,age,department) values (102,'HIMANSHU',24,'QEA');
# ''')

cursor.execute('''
INSERT INTO employees (id,name,age,department) values (103,'KRISH',32,'DATA SCIENCE');
''')

cursor.execute('''
INSERT INTO employees (id,name,age,department) values (104,'HARIOM',24,'OPERATIONS');
''')

cursor.execute('''
INSERT INTO employees (id,name,age,department) values (105,'SHWETA',24,'HR')
''')

cursor.execute('''
INSERT INTO employees (id,name,age,department) values (106,'ANURAG BANSAL',26,'WEB DEVELOPMENT')
''')

cursor.execute('''
INSERT INTO employees (id,name,age,department) values (107,'ABHINAV GAUR',24,'WEB DEVELOPMENT')
''')

connection.commit() # always commit the changes , it will update the data in the table

In [8]:
cursor.execute('''
Select * from employees
''')

In [9]:
# Querying the data from table
cursor.execute('Select * from employees')
rows = cursor.fetchall()

for row in rows:
  print(row)

(101, 'ANAND RAJ', 24, 'DATA SCIENCE')
(103, 'KRISH', 32, 'DATA SCIENCE')
(104, 'HARIOM', 24, 'OPERATIONS')
(105, 'SHWETA', 24, 'HR')
(106, 'ANURAG BANSAL', 26, 'WEB DEVELOPMENT')
(107, 'ABHINAV GAUR', 24, 'WEB DEVELOPMENT')

In [10]:
cursor.execute('''
UPDATE employees
SET age = 34 where name = 'KRISH'
''')

connection.commit()

In [11]:
cursor.execute('Select * from employees')
rows = cursor.fetchall()

for row in rows:
  print(row)

(101, 'ANAND RAJ', 24, 'DATA SCIENCE')
(103, 'KRISH', 34, 'DATA SCIENCE')
(104, 'HARIOM', 24, 'OPERATIONS')
(105, 'SHWETA', 24, 'HR')
(106, 'ANURAG BANSAL', 26, 'WEB DEVELOPMENT')
(107, 'ABHINAV GAUR', 24, 'WEB DEVELOPMENT')

In [12]:
# Made a function to see tha data from the table
def getdata(sqlite3):
  sqlite3.execute('Select * from employees')
  rows = sqlite3.fetchall()

  for row in rows:
    print(row)

In [13]:
getdata(cursor)

(101, 'ANAND RAJ', 24, 'DATA SCIENCE')
(103, 'KRISH', 34, 'DATA SCIENCE')
(104, 'HARIOM', 24, 'OPERATIONS')
(105, 'SHWETA', 24, 'HR')
(106, 'ANURAG BANSAL', 26, 'WEB DEVELOPMENT')
(107, 'ABHINAV GAUR', 24, 'WEB DEVELOPMENT')

In [14]:
# Deleting the data from table
cursor.execute('''
DELETE FROM employees where name = 'SHWETA'
''')

connection.commit()
getdata(cursor)

(101, 'ANAND RAJ', 24, 'DATA SCIENCE')
(103, 'KRISH', 34, 'DATA SCIENCE')
(104, 'HARIOM', 24, 'OPERATIONS')
(106, 'ANURAG BANSAL', 26, 'WEB DEVELOPMENT')
(107, 'ABHINAV GAUR', 24, 'WEB DEVELOPMENT')

making a working model with help of sqlite

In [15]:
connection = sql.connect('sales_data.db')
cursor = connection.cursor()

In [16]:
cursor.execute('''
CREATE TABLE IF NOT EXISTS sales (
  id INTEGER PRIMARY KEY,
  date TEXT NOT NULL,
  product TEXT NOT NULL,
  sales INTEGER,
  region TEXT
)
''')

connection.commit()

In [17]:
sales_data = [
    ('2023-01-01', 'Product A', 100, 'North'),
    ('2023-01-02', 'Product B', 150, 'South'),
    ('2023-01-03', 'Product A', 120, 'East'),
    ('2023-01-04', 'Product C', 200, 'West'),
    ('2023-01-05', 'Product B', 90, 'North'),
    ('2023-01-06', 'Product A', 110, 'South'),
    ('2023-01-07', 'Product C', 180, 'East')
]

In [18]:
#bulk insertion
cursor.executemany('''
INSERT INTO sales (date, product, sales, region)
VALUES (?, ?, ?, ?)
''', sales_data)

connection.commit()

In [19]:
def getdata(sqlite3):
  sqlite3.execute('Select * from sales')
  rows = sqlite3.fetchall()

  for row in rows:
    print(row)

In [20]:
getdata(cursor)

(1, '2023-01-01', 'Product A', 100, 'North')
(2, '2023-01-02', 'Product B', 150, 'South')
(3, '2023-01-03', 'Product A', 120, 'East')
(4, '2023-01-04', 'Product C', 200, 'West')
(5, '2023-01-05', 'Product B', 90, 'North')
(6, '2023-01-06', 'Product A', 110, 'South')
(7, '2023-01-07', 'Product C', 180, 'East')

In [21]:
# close the connection
connection.close()

In [22]:
getdata(cursor)

ProgrammingError: Cannot operate on a closed database.